common/services/system/AdminStructService.php

SELECT * FROM `b5net_admin_struct` WHERE `admin_id`='10000'
---
    public static function getStructByAdminId($admin_id, $showStruct = false)
    {
        if (!$admin_id) return [];

        $list = (new \yii\db\Query())->from(AdminStruct::tableName())->where(['admin_id' => $admin_id])->all();