common/services/system/AdminRoleService.php

    public static function getRoleByAdmin($admin_id, $showRole = false): array
    {
        if (!$admin_id) return [];

        $list = (new \yii\db\Query())->from(AdminRole::tableName())->where(['admin_id' => $admin_id])->all();
---
SELECT * FROM `b5net_admin_role` WHERE `admin_id`='10000'